{
"_meta": {
    "sources": [
        {
            "json": "BloodMageClass",
            "abbreviation": "BM",
            "full": "Blood Mage Class",
            "authors": [
                "Zion"
            ],
            "version": "2.0.0",
            "color": "f44444"
        }
    ]
},

"class": [
    {
        "name": "Blood Mage",
        "source": "BloodMageClass",
        "hd": {
            "number": 1,
            "faces": 10
            },
        "proficiency": [
            "con",
            "int"
        ],
        "startingProficiencies": {
            "armor": [
                "light"
            ],
            "weapons": [
                "simple"
            ],
            "skills": [
                {
                "choose": {
                    "from": [
                        "arcana",
                        "history",
                        "insight",
                        "investigation",
                        "medicine",
                        "religion"
                    ],
                    "count": 2
                }
                }
            ]
        },
        "startingEquipment": {
            "default": [
                "(a) a quarterstaff or (b) a dagger",
                "(a) a scholar's pack or (b) an explorer's pack",
                "A blood orb",
                "A spellbook"
            ],
            "additionalFromBackground": true,
            "goldAlternative": "{@dice 4d4 * 10}"
        },
        "classSpells": [
            {
                "class": "Wizard",
                "source": "PHB"
            }
        ],
        "classTableGroups": [
            {
                "colLabels": [
                    "Cantrips Known"
                ],
                "rows": [
                    ["3"],
                    ["3"],
                    ["3"],
                    ["4"],
                    ["4"],
                    ["4"],
                    ["4"],
                    ["4"],
                    ["4"],
                    ["4"],
                    ["5"],
                    ["5"],
                    ["5"],
                    ["5"],
                    ["5"],
                    ["5"],
                    ["5"],
                    ["5"],
                    ["5"],
                    ["5"]
                ]
            },
            {
                "colLabels": [
                    "Castable Spell Level"
                ],
                "rows": [
                    ["1st"],
                    ["1st"],
                    ["2nd"],
                    ["2nd"],
                    ["3rd"],
                    ["3rd"],
                    ["4th"],
                    ["4th"],
                    ["5th"],
                    ["5th"],
                    ["6th"],
                    ["6th"],
                    ["7th"],
                    ["7th"],
                    ["8th"],
                    ["8th"],
                    ["9th"],
                    ["9th"],
                    ["9th"],
                    ["9th"]
                ]
            }
        ],
        "classFeatures": [
            "Extract Soul|Blood Mage|BloodMageClass|1|BloodMageClass",
            "Spellcasting|Blood Mage|BloodMageClass|1|BloodMageClass",
            "Manipulation Focus|Blood Mage|BloodMageClass|2|BloodMageClass",
            "Ability Score Improvement|Blood Mage|BloodMageClass|4|BloodMageClass",
            "Absorb Soul|Blood Mage|BloodMageClass|5|BloodMageClass",
            "Manipulation Focus Feature|Blood Mage|BloodMageClass|6|BloodMageClass",
            "Ability Score Improvement|Blood Mage|BloodMageClass|8|BloodMageClass",
            "Manipulation Focus Feature|Blood Mage|BloodMageClass|10|BloodMageClass",
            "Ability Score Improvement|Blood Mage|BloodMageClass|12|BloodMageClass",
            "Manipulation Focus Feature|Blood Mage|BloodMageClass|14|BloodMageClass",
            "Ability Score Improvement|Blood Mage|BloodMageClass|16|BloodMageClass",
            "Ability Score Improvement|Blood Mage|BloodMageClass|19|BloodMageClass",
            "Perfect Soul Exchange|Blood Mage|BloodMageClass|20|BloodMageClass"
        ]
    }
],
"classFeature": [
    {
        "name": "Extract Soul",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 1,
        "entries": [
            "You have learned how to extract the magical essence of your blood known as soul. Beginning at 1st level, you may use a bonus action to extract blood equal to a number of hitpoints up to current value. You then refine that blood into that number of soul. You may then take an action to put that soul into an attuned blood orb, or use it to fuel a spell. Soul that you do not use in the turn of extraction dissapates without any effect."
        ]
    },
    {
        "name": "Spellcasting",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 1,
        "entries": [
                "As a wielder of blood magic, you extract the magical essence of your blood, known as soul, to create magical effects. Soul once in its pure form dissapates quickly, lasting not for more than a few seconds. Because of that fact blood mages utilize objects known as blood orbs; they are cabable of preserving soul in its pure form. This allows blood mages to harness soul both more frequently and in larger quantities. Blood mages use the {@link wizard spell list|https://5e.tools/spells.html#blankhash,flstclass:wizard=1}",
            {
                "type": "entries",
                "name":"Cantrips",
                "entries": [
                    "The nature of blood magic doesn't lend well to minor magic such as cantrips as every effect in blood magic comes with a price. For that reason blood mages typically learn how to harness arcane magic, similar to that of a wizard, in order to create those minor effects.",
                    "At 1st level, you know 3 cantrips from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Blood Mage table."
                ]
            },
            {
                "type": "entries",
                "name":"Blood Orb",
                "entries": [
                    "Blood orbs are items created by blood mages to store soul for later use. Blood orbs are also crafted with a set soul capacity. Blood orbs normally require attunement but while attuned you can use the soul stored in a blood orb as though it were just extracted; there is also a ritual for bypassing the attunement requirement known as heartbinding.",
                    "At 1st level, you have a blood orb that can't store any soul on it's own but instead is meant to be heartbound.",
                    {
                        "type": "entries",
                        "name": "Heartbinding",
                        "entries": [
                            "Heartbinding is a ritual used by blood mages to bind a blood orb to their heart; only one blood orb can be bound at once. This has two effects; the first is that a heartbound blood orb counts as attuned but doesn't take a slot, the second is that the soul capacity of the blood orb is enhanced.",
                            "The amount by which the soul capacity is enhanced is equal to 100 * your blood mage level. For example, if you were a 4th level blood mage and you were binding a blood orb that can store 100 soul on its own, then after it was bound it would be able to store 500 soul.",
                            "The ritual to bind a blood orb takes 1 hour to complete. If you are replacing a blood orb that is already heartbound, then any soul stored in the blood orb being replaced that exceeds the natural limit of that blood orb disappears upon completion of the ritual."
                        ]
                    }
                ]
            },
            {
                "type": "entries",
                "name": "Spellbook",
                "entries": [
                    "At 1st level, you have a spellbook containing six 1st-level blood mage spells of your choice. Your spellbook is the repository of the blood mage spells you know, except your cantrips, which are fixed in your mind."
                ]
            },
            {
                "type": "entries",
                "name": "Casting Spells",
                "entries": [
                    "Blood magic is fueled by soul; the magical essence found in living things. The level of spell directly correlates to the amount of soul required to fuel that spell. The soul used to fuel your spells can be acquired from a blood orb with soul stored inside and or from soul extracted within the same turn, and when used is expended permanently. The cost for each level of spell can be found below.",
                    {
                        "type": "table",
                        "colLabels": [
                            "Spell level",
                            "Soul cost"
                        ],
                        "colStyles": [
                            "col-1-6 text-center",
                            "col-1-6 text-center"
                        ],
                        "rows": [
                            [
                                "1st",
                                "10"
                            ],
                            [
                                "2nd",
                                "30"
                            ],
                            [
                                "3rd",
                                "60"
                            ],
                            [
                                "4th",
                                "100"
                            ],
                            [
                                "5th",
                                "150"
                            ],
                            [
                                "6th",
                                "210"
                            ],
                            [
                                "7th",
                                "280"
                            ],
                            [
                                "8th",
                                "360"
                            ],
                            [
                                "9th",
                                "450"
                            ]
                        ]
                    },
                    "For example, if you want to cast a 4th level spell and you have 60 soul stored in your blood orb plus 50 hitpoints, you may use the Extract Soul feature to extract 40 soul, losing 40 hitpoints in the process, to get to the total of 100 soul needed to cast the spell."
                ]
            },
            {
                "type": "entries",
                "name": "Preparing Spells",
                "entries": [
                    "You prepare the list of spells that are available for you to cast. To do so, choose a number of spells from your spellbook equal to your Intelligence modifier + your blood mage level (minimum of one spell).",
                    "You can change your list of prepared spells when you finish a long rest. Preparing a new list of spells requires time spent studying your spellbook and memorizing how you must manipulate the soul to cast the spell: at least 1 minute per spell level for each spell on your list."
                ]
            },
            {
                "type": "entries",
                "name": "Spellcasting Ablility",
                "entries": [
                    "Intelligence is your spellcasting ability for your spells, since you learn your spells through dedicated study, adaptation, and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a spell you cast and when making an attack roll with one.",
                    {
                        "type": "abilityDc",
                        "name": "Spell",
                        "attributes": [
                            "int"
                        ]
                    },
                    {
                        "type": "abilityAttackMod",
                        "name": "Spell",
                        "attributes": [
                            "int"
                        ]
                    }
                ]
            },
            {
                "type": "entries",
                "name": "Ritualizing and Wielding a Spellbook",
                "entries": [
                    "You may cast spells in your spellbook that you do not have prepared by ritualizing their entries in your spellbook and then wielding your spellbook.",
                    "In order to ritualize a spell in your spellbook you must take time to create mental and visual shorthands describing how to cast that spell. This takes time and money as you must practice the spell using the shorthands you created. Ritualizations created by other blood mages are also not copyable as their shorthands are unique to them just as yours are to you. For each level of the spell, the process takes a full day and costs 100gp. The cost represents material components you expend as you experiment with the ritualization to master it, as well as the fine inks you need to record it.",
                    "Casting a ritualized spell from your spellbook requires you to wield the spellbook as you need to be able to read your shorthands as you cast it. Wielding your spellbook requires one hand. Your spellbook must be turned to the ritualized entry of the spell you want to cast.",
                    "You may use a bonus-action to flip to any entry in your spellbook.",
                    "So, if you have ritualized the spell, are wielding your spellbook, and have opened it to the page with the correct entry; you may cast the spell as if you had it prepared."
                ]
            },
            {
                "type": "entries",
                "name": "Spellcasting Focus",
                "entries": [
                    "You can use a spellbook or a blood orb as a spellcasting focus for your blood mage spells."
                ]
            },
            {
                "type": "entries",
                "name": "Learning Spells of 1st Level and Higher",
                "entries": [
                    "Each time you gain a blood mage level, you can add two blood mage spells of your choice to your spellbook. Each of these spells must be of a castable level for your blood mage level, as shown on the Blood Mage table. On your adventures, you might find other spells that you can add to your spellbook (see \"Your Spellbook\").",
                    {
                        "type": "inset",
                        "name": "Your Spellbook",
                        "entries": [
                            "The spells that you add to your spellbook as you gain levels reflect the research you conduct on your own, as well as intellectual breakthroughs you have had about the nature of soul. You might find other spells during your adventures. You could discover a spell recorded on a scroll in an evil blood mage's chest, for example, or in a dusty tome in an ancient library.",
                            "A spellbook doesn't contain cantrips.",
                            {
                                "type": "entries",
                                "name": "Copying a Spell into the Book",
                                "entries": [
                                    "When you find a blood mage spell of 1st level or higher, you can add it to your spellbook if it is of a spell level you can cast and if you can spare the time to decipher and copy it.",
                                    "Copying a spell into your spellbook involves reproducing the basic form of the spell, then deciphering the unique system of notation used by the blood mage who wrote it. You must practice the spell until you understand the sounds or gestures required, then transcribe it into your spellbook using your own notation.",
                                    "For each level of the spell, the process takes 2 hours and costs 50 gp. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it. Once you have spent this time and money, you can prepare the spell just like your other spells.",
                                    "A blood mage spell on a spell scroll can be copied just as spells in spellbooks can be copied. When you copy a spell from a spell scroll, you must succeed on an Intelligence (Arcana) check with a DC equal to 10 + the spell's level. If the check succeeds, the spell is successfully copied. Whether the check succeeds or fails, the spell scroll is destroyed."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "Replacing the Book",
                                "entries": [
                                    "You can copy a spell from your own spellbook into another book—for example, if you want to make a backup copy of your spellbook. This is just like copying a new spell into your spellbook, but faster and easier, since you understand your own notation and already know how to cast the spell. You need spend only 1 hour and 10 gp for each level of the copied spell.",
                                    "If you lose your spellbook, you can use the same procedure to transcribe the spells that you have prepared into a new spellbook. Filling out the remainder of your spellbook requires you to find new spells to do so, as normal. For this reason, many blood mages keep backup spellbooks in a safe place."
                                ]
                            },
                            {
                                "type": "entries",
                                "name": "The Book's Appearance",
                                "entries": [
                                    "Your spellbook is a unique compilation of spells, with its own decorative flourishes and margin notes. It might be a plain, functional leather volume that you received as a gift from your master, a finely bound gilt-edged tome you found in an ancient library, or even a loose collection of notes scrounged together after you lost your previous spellbook in a mishap."
                                ]
                            }
                        ]
                    },
                    {
                        "type": "inset",
                        "name": "Variant Spell Copying",
                        "entries": [
                            "If your DM allows it, blood mages at your table may be allowed to adapt and copy wizard spells into blood mage spellbooks."
                        ]
                    }
                ]
            }
        ]
    },
    {
        "name": "Manipulation Focus",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 2,
        "entries": [
            "When you reach 2nd level, you choose a Manipulation Focus from the list of available Manipulation Foci, shaping your manipulation of soul. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
        ],
        "gainSubclassFeature": true
    },
    {
        "name": "Ability Score Improvement",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 4,
        "entries": [
            "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a {@link feat|https://5e.tools/feats.html#}."
        ]
    },
    {
        "name": "Absorb Soul",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 5,
        "entries": [
            "After reaching 5th level, you have learned how to reverse the extraction process. You may take 1 action to heal 1 hitpoint. Absorbing soul is less efficient than extracting it, requiring 2 soul per hitpoint to complete.",
            "For example, if you take 1 minute to absorb soul you can absorb 20 soul and heal 10 hitpoints."
        ]
    },
    {
        "name": "Manipulation Focus Feature",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 6,
        "entries": [
            "At 6th level, you gain a feature granted by your Manipulation Focus."
        ],
        "gainSubclassFeature": true
    },
    {
        "name": "Ability Score Improvement",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 8,
        "entries": [
            "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a {@link feat|https://5e.tools/feats.html#}."
        ]
    },
    {
        "name": "Manipulation Focus Feature",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 10,
        "entries": [
            "At 10th level, you gain a feature granted by your Manipulation Focus."
        ],
        "gainSubclassFeature": true
    },
    {
        "name": "Ability Score Improvement",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 12,
        "entries": [
            "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a {@link feat|https://5e.tools/feats.html#}."
        ]
    },
    {
        "name": "Manipulation Focus Feature",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 14,
        "entries": [
            "At 14th level, you gain a feature granted by your Manipulation Focus."
        ],
        "gainSubclassFeature": true
    },
    {
        "name": "Ability Score Improvement",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 16,
        "entries": [
            "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a {@link feat|https://5e.tools/feats.html#}."
        ]
    },
    {
        "name": "",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 18,
        "entries": [
            ""
        ]
    },
    {
        "name": "Ability Score Improvement",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 19,
        "entries": [
            "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "If your DM allows the use of feats, you may instead take a {@link feat|https://5e.tools/feats.html#}."
        ]
    },
    {
        "name": "Perfect Soul Exchange",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "level": 20,
        "entries": [
            "Your mastery of blood magic has manifested in the perfect exchange of soul into blood and blood into soul.",
            "You may now perform all of the effects of {@classFeature Extract Soul|Blood Mage|BloodMageClass|1} as a free action.",
            "The effects of {@classFeature Absorb Soul|Blood Mage|BloodMageClass|5} are now 5 hitpoints for a bonus action; instead of 1 hitpoint for an action. The cost is now 1 soul per hitpoint; instead of 2 soul per hitpoint."
        ]
    }
],
"subclass": [
    {
        "name": "Vampiric Focus",
        "source": "BloodMageClass",
        "shortName": "Vampiric",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "subclassFeatures": [
            "Vampiric Focus|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|2|BloodMageClass",
            "Inject Soul|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|6|BloodMageClass",
            "Improved Soul Vampirism|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|10|BloodMageClass",
            "Full Drain|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|14|BloodMageClass"
        ]
    }
],
"subclassFeature": [
    {
        "name": "Vampiric Focus",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "subclassShortName": "Vampiric",
        "subclassSource": "BloodMageClass",
        "level": 2,
        "entries": [
            "Vampiric soul blood mages focus on manipulating the blood in other creatures; stealing the soul from their blood, injecting your soul into their blood to shock their body, etc.",
            {
                "type": "refSubclassFeature",
                "subclassFeature": "Steal Soul|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|2|BloodMageClass"
            }
        ]
    },
    {
        "name": "Steal Soul",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "subclassShortName": "Vampiric",
        "subclassSource": "BloodMageClass",
        "level": 2,
        "entries": [
            "You learn how to forcibly extract the blood of living creatures and refine it into soul for your own use.",
            "You may use an action to make a melee spell attack with an empty hand against a creature with blood. On a hit, you may extract a number of soul up to {@dice 1d10} + your blood mage level(or the creatures current hitpoints, whichever is lower); you then store that soul in an attuned blood orb. The creature affected loses an equal number of hitpoints just as with the {@classFeature Extract Soul|Blood Mage|BloodMageClass|1} feature.",
            "If you use this feature on a willing creature, you may extract as much soul as the creature has hitpoints."
        ]
    },
    {
        "name": "Inject Soul",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "subclassShortName": "Vampiric",
        "subclassSource": "BloodMageClass",
        "header": 2,
        "level": 6,
        "entries": [
            "You learn how to use the soul absorbtion process to cause various effects to other creatures.",
            "You may use an action to make a melee spell attack with an empty hand against a creature. On a hit, you may inject a number of soul causing one of the effects below, the target then makes the corresponding save against your spell save DC.",
            {
                "type": "table",
                "colLabels": [
                    "Effect",
                    "Save",
                    "Soul cost"
                ],
                "colStyles": [
                    "col-1-6 text-center",
                    "col-1-6 text-center",
                    "col-1-6 text-center"
                ],
                "rows": [
                    [
                        "Knock Prone",
                        "Strength, Dexterity",
                        "5"
                    ],
                    [
                        "Push 5-30ft.",
                        "Strength",
                        "1 per ft."
                    ],
                    [
                        "Stun until the end of your next turn",
                        "Constitution",
                        "20"
                    ],
                    [
                        "Paralyze until the end of your next turn",
                        "Constitution",
                        "40"
                    ]
                ]
            }
        ]
    },
    {
        "name": "Improved Soul Vampirism",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "subclassShortName": "Vampiric",
        "subclassSource": "BloodMageClass",
        "header": 2,
        "level": 10,
        "entries": [
            "Through repetition and practice you have improved you soul vampirism. You can now choose to make ranged spell attacks for {@subclassFeature Steal Soul|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|2} and {@subclassFeature Inject Soul|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|6}; the range for which is 30 feet. You may now extract {@dice 3d10} + your blood mage level with {@subclassFeature Steal Soul|Blood Mage|BloodMageClass|Vampiric|BloodMageClass|2}."
        ]
    },
    {
        "name": "Full Drain",
        "source": "BloodMageClass",
        "className": "Blood Mage",
        "classSource": "BloodMageClass",
        "subclassShortName": "Vampiric",
        "subclassSource": "BloodMageClass",
        "header": 2,
        "level": 14,
        "entries": [
            "As your abilities have matured your soul vampirism has culminated in the ability to fully drain the blood of a creature; refining it into soul and storing it in an attuned blood orb.",
            "You may take an action to make a melee spell attack with an empty hand against a medium or smaller creature with blood. On a hit, the target must make a Constitution saving throw; the target is then considered {@condition grappled} and {@condition restrained}. On a success, the target takes 4d10 necrotic damage. On a failure, you may extract soul worth up to half of the target's max hitpoints. Until the target is no longer {@condition grappled}, the target must make the same Constitution save with the same consequences on your turns.",
            "After you have used this feature you must finish a long rest before you can use it again."
        ]
    }
],
"item": [
    {
        "name": "Blood Orb",
        "rarity": "varies",
        "source": "BloodMageClass",
        "wondrous": true,
        "reqAttune": "by a blood mage",
        "entries": [
            "A blood orb stores soul for blood mages. In order to interact with the blood orb you must be attuned to it.",
            "If you are attuned to the blood orb you may use any soul contained inside as fuel for your blood mage spells. You may also store soul inside it using the Extract Soul feature.",
            "The rarity of the blood orb is determined by its soul capacity, as shown below.",
            {
                "type": "table",
                "colLabels": [
                    "Soul Capacity",
                    "Rarity"
                ],
                "colStyles": [
                    "col-1-6 text-center",
                    "col-1-6 text-center"
                ],
                "rows": [
                    [
                        "0",
                        "Common"
                    ],
                    [
                        "1-100",
                        "Uncommon"
                    ],
                    [
                        "101-500",
                        "Rare"
                    ],
                    [
                        "501-750",
                        "Very Rare"
                    ],
                    [
                        "Above 750",
                        "Legendary"
                    ]
                ]
            }
        ]
    }
]
}