{
	"_meta": {
		"sources": [
			{
				"json": "AlexBackground",
				"abbreviation": "BP",
				"full": "Banished Prince",
				"authors": [
					"Zion",
					"Dartanian"
				],
				"convertedBy": [
					"Zion"
				],
				"version": "1.0.3",
				"color": "000022"
			}
		],
		"dateAdded": 0,
		"dateLastModified": 2
	},
	"background": [
		{
			"name": "Banished Prince",
			"source": "AlexBackground",
			"skillProficiencies": [
				{
					"history": true,
					"persuasion": true
				}
			],
			"toolProficiencies": [
				{
					"choose": {
						"from": [
							"anyMusicalInstrument",
							"gaming set"
						],
						"count": 1
					}
				}
			],
			"languageProficiencies": [
				{
					"anyStandard": 1
				}
			],
			"startingEquipment": [
				{
					"_": [
						"traveler's clothes|phb",
						{
							"special": "Signet Ring"
						},
						{
							"item": "pouch|phb",
							"containsValue": 500
						}
					]
				},
				{
					"a": [
						{
							"equipmentType": "instrumentMusical"
						}
					],
					"b": [
						{
							"equipmentType": "setGaming"
						}
					]
				}
			],
			"entries": [
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Skill Proficiencies:",
							"entry": "{@skill History}, {@skill Persuasion}"
						},
						{
							"type": "item",
							"name": "Tool Proficiencies:",
							"entry": "Any one {@filter musical instrument|items|source=phb|miscellaneous=mundane|type=instrument} or {@filter gaming set|items|source=phb|miscellaneous=mundane|type=gaming set} of your choice, likely something native to your homeland"
						},
						{
							"type": "item",
							"name": "Languages:",
							"entry": "Any one of your choice"
						},
						{
							"type": "item",
							"name": "Equipment:",
							"entry": "One set of {@item traveler's clothes|phb}, any one {@filter musical instrument|items|source=phb|miscellaneous=mundane|type=instrument} or {@filter gaming set|items|source=phb|miscellaneous=mundane|type=gaming set} you are proficient with, a signet ring that once offered power and control over your people, and a {@item pouch|phb} containing 5 gp"
						}
					]
				},
				{
					"name": "Overview",
					"type": "entries",
					"entries": [
						"Exiled from the land and the dynasty that you once called home, you have wandered lands far and wide, seeking a new purpose to fill the void left behind by the absence of your royal title. While you have begun to learn to accept your new lot in life, there is certainly a long road ahead to become the person you were meant to be. But be warned, my liege, your past, and the demons therein, threaten the very path you have sworn to walk.",
						"Over the course of your travels, you have learned to trust in the common folk, and they, in turn, have learned to trust you as well. Although you are afforded the trust of the people, they recognize you as a man from a strange land. Certain characteristics of yours stand out as decidedly foreign. It might be your belongings, your looks, the way you speak or carry yourself, perhaps all of these, but regardless, your persona is one not of this continent."
					]
				},
				{
					"name": "Feature: Stranger From a Strange Land",
					"type": "entries",
					"entries": [
						"Your accent, mannerisms, figures of speech, and perhaps even your appearance all mark you as foreign. Curious glances are directed your way wherever you go, which can be a nuisance, but you also gain the friendly interest of scholars and others intrigued by far-off lands, to say nothing of everyday folk who are eager to hear stories of your homeland.",
						"You can parley this attention into access to people and places you might not otherwise have, for you and your traveling companions. Noble lords, scholars, and merchant princes, to name a few, might be interested in hearing about your distant homeland and people."
					],
					"data": {
						"isFeature": true
					}
				},
				{
					"name": "Feature: Draconic Renown",
					"type": "entries",
					"entries": [
						"Your renown as a Dragon Templar affords you rest, sustenance, and a place to hang your cloak where you might otherwise find none. You can find a place to hide, rest, or recuperate among other commoners, unless you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
					],
					"data": {
						"isFeature": true
					}
				}
			]
		}
	]
}
